ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32F4/STM32Cube_FW/stm32f4xx_hal_conf.h
#if !defined  (USE_HAL_DMA2D_REGISTER_CALLBACKS)
  #define  USE_HAL_DMA2D_REGISTER_CALLBACKS       0U /* DMA2D register callback disabled     */
#endif

#if !defined  (USE_HAL_DSI_REGISTER_CALLBACKS)
  #define  USE_HAL_DSI_REGISTER_CALLBACKS         0U /* DSI register callback disabled       */
#endif

#if !defined  (USE_HAL_ETH_REGISTER_CALLBACKS)
  #define  USE_HAL_ETH_REGISTER_CALLBACKS         0U /* ETH register callback disabled       */
#endif

#if !defined  (USE_HAL_HASH_REGISTER_CALLBACKS)
  #define  USE_HAL_HASH_REGISTER_CALLBACKS        0U /* HASH register callback disabled      */
#endif

#if !defined  (USE_HAL_HCD_REGISTER_CALLBACKS)
  #define  USE_HAL_HCD_REGISTER_CALLBACKS         0U /* HCD register callback disabled       */
#endif

#if !defined  (USE_HAL_I2C_REGISTER_CALLBACKS)
  #define  USE_HAL_I2C_REGISTER_CALLBACKS         0U /* I2C register callback disabled       */
#endif

#if !defined  (USE_HAL_FMPI2C_REGISTER_CALLBACKS)
  #define  USE_HAL_FMPI2C_REGISTER_CALLBACKS      0U /* FMPI2C register callback disabled    */
#endif

#if !defined  (USE_HAL_FMPSMBUS_REGISTER_CALLBACKS)
  #define  USE_HAL_FMPSMBUS_REGISTER_CALLBACKS    0U /* FMPSMBUS register callback disabled  */
#endif

#if !defined  (USE_HAL_I2S_REGISTER_CALLBACKS)
  #define  USE_HAL_I2S_REGISTER_CALLBACKS         0U /* I2S register callback disabled       */
#endif

#if !defined  (USE_HAL_IRDA_REGISTER_CALLBACKS)
  #define  USE_HAL_IRDA_REGISTER_CALLBACKS        0U /* IRDA register callback disabled      */
#endif

#if !defined  (USE_HAL_LPTIM_REGISTER_CALLBACKS)
  #define  USE_HAL_LPTIM_REGISTER_CALLBACKS       0U /* LPTIM register callback disabled     */
#endif

#if !defined  (USE_HAL_LTDC_REGISTER_CALLBACKS)
  #define  USE_HAL_LTDC_REGISTER_CALLBACKS        0U /* LTDC register callback disabled      */
#endif

#if !defined  (USE_HAL_MMC_REGISTER_CALLBACKS)
  #define  USE_HAL_MMC_REGISTER_CALLBACKS         0U /* MMC register callback disabled       */
#endif

#if !defined  (USE_HAL_NAND_REGISTER_CALLBACKS)
  #define  USE_HAL_NAND_REGISTER_CALLBACKS        0U /* NAND register callback disabled      */
#endif

#if !defined  (USE_HAL_NOR_REGISTER_CALLBACKS)
  #define  USE_HAL_NOR_REGISTER_CALLBACKS         0U /* NOR register callback disabled       */
#endif

#if !defined  (USE_HAL_PCCARD_REGISTER_CALLBACKS)
  #define  USE_HAL_PCCARD_REGISTER_CALLBACKS      0U /* PCCARD register callback disabled    */
#endif

#if !defined  (USE_HAL_PCD_REGISTER_CALLBACKS)
  #define  USE_HAL_PCD_REGISTER_CALLBACKS         0U /* PCD register callback disabled       */
#endif

#if !defined  (USE_HAL_QSPI_REGISTER_CALLBACKS)
  #define  USE_HAL_QSPI_REGISTER_CALLBACKS        0U /* QSPI register callback disabled      */
#endif

#if !defined  (USE_HAL_RNG_REGISTER_CALLBACKS)
  #define  USE_HAL_RNG_REGISTER_CALLBACKS         0U /* RNG register callback disabled       */
#endif

#if !defined  (USE_HAL_RTC_REGISTER_CALLBACKS)
  #define  USE_HAL_RTC_REGISTER_CALLBACKS         0U /* RTC register callback disabled       */
#endif

#if !defined  (USE_HAL_SAI_REGISTER_CALLBACKS)
  #define  USE_HAL_SAI_REGISTER_CALLBACKS         0U /* SAI register callback disabled       */
#endif

#if !defined  (USE_HAL_SD_REGISTER_CALLBACKS)
  #define  USE_HAL_SD_REGISTER_CALLBACKS          0U /* SD register callback disabled        */
#endif

#if !defined  (USE_HAL_SMARTCARD_REGISTER_CALLBACKS)
  #define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS   0U /* SMARTCARD register callback disabled */
#endif

#if !defined  (USE_HAL_SDRAM_REGISTER_CALLBACKS)
  #define  USE_HAL_SDRAM_REGISTER_CALLBACKS       0U /* SDRAM register callback disabled     */
#endif

#if !defined  (USE_HAL_SRAM_REGISTER_CALLBACKS)
  #define  USE_HAL_SRAM_REGISTER_CALLBACKS        0U /* SRAM register callback disabled      */
#endif

#if !defined  (USE_HAL_SPDIFRX_REGISTER_CALLBACKS)
  #define  USE_HAL_SPDIFRX_REGISTER_CALLBACKS     0U /* SPDIFRX register callback disabled   */
#endif

#if !defined  (USE_HAL_SMBUS_REGISTER_CALLBACKS)
  #define  USE_HAL_SMBUS_REGISTER_CALLBACKS       0U /* SMBUS register callback disabled     */
#endif

#if !defined  (USE_HAL_SPI_REGISTER_CALLBACKS)
  #define  USE_HAL_SPI_REGISTER_CALLBACKS         0U /* SPI register callback disabled       */
#endif

#if !defined  (USE_HAL_TIM_REGISTER_CALLBACKS)
  #define  USE_HAL_TIM_REGISTER_CALLBACKS         0U /* TIM register callback disabled       */
#endif

#if !defined  (USE_HAL_UART_REGISTER_CALLBACKS)
  #define  USE_HAL_UART_REGISTER_CALLBACKS        0U /* UART register callback disabled      */
#endif

#if !defined  (USE_HAL_USART_REGISTER_CALLBACKS)
  #define  USE_HAL_USART_REGISTER_CALLBACKS       0U /* USART register callback disabled     */
#endif

#if !defined  (USE_HAL_WWDG_REGISTER_CALLBACKS)
  #define  USE_HAL_WWDG_REGISTER_CALLBACKS        0U /* WWDG register callback disabled      */
#endif

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0   2U
#define MAC_ADDR1   0U
#define MAC_ADDR2   0U
#define MAC_ADDR3   0U
#define MAC_ADDR4   0U
#define MAC_ADDR5   0U

/* Definition of the Ethernet driver buffers size and count */   
#ifdef MBED_CONF_STM32_EMAC_ETH_RXBUFNB
/* default value in connectivity/drivers/emac/TARGET_STM/mbed_lib.json */
#define ETH_RXBUFNB                    MBED_CONF_STM32_EMAC_ETH_RXBUFNB  /* Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB                    MBED_CONF_STM32_EMAC_ETH_TXBUFNB  /* Tx buffers of size ETH_TX_BUF_SIZE  */
#else
/* ex: bare metal profile */
#define ETH_RXBUFNB                    0  /* Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB                    0  /* Tx buffers of size ETH_TX_BUF_SIZE  */
#endif

